export type UUID = ReturnType<typeof crypto.randomUUID>;

// notion name -> discord name
export const nameMap = new Map<string, `${number}`>([
  // 運営
  ["Ryuhei TAKANAKA", "905761740665528370"],

  // 運営ではないけど運営タスクに名前のある人
  ["川端 悠斗", "943071631167860756"],
]);

// notion id -> discord id
export const idMap = new Map<UUID, `${number}`>([
  // 柴山 慧一郎
  ["57a59982-d155-41f6-bd2c-17ae71c07b3e", "660420646261489674"],

  // 大矢 宏輝
  ["17c5ee7e-e899-48a6-b766-893d42812f99", "735679928007131213"],

  // 安村 拓也
  ["e2584440-8f00-4e2e-98c8-ab1fcc9fd8ca", "1225332719068643424"],

  // 小林 由暉
  ["6ae4d1f2-f45d-4603-9c99-adaacb7f071a", "502798784959479808"],

  // 中村 渉吾
  ["bd95e514-0177-4688-bd77-c259abc90801", "703588743738687488"],

  // 眞鍋 快地
  ["c7c551dc-3872-4dd7-b957-a61477c2d4a6", "1119186793099710514"],

  // 川端 悠斗
  ["20cd872b-594c-81a1-8d1c-00021799c108", "943071631167860756"],

  // 山田 太郎
  ["3c8fa1ff-5ffe-4bff-8698-977e1a2c2901", "978927460810903572"],

  // 綿引 悠人
  ["389151d4-cd20-4779-9cb6-bdf5cfbc3bca", "1238870985864646797"],

  // 永谷 龍彦
  ["56668f9e-8c74-479e-99a6-4f26c2c9f6e7", "733619490666971166"],
]);
